Khalid10Z/reactjs_weather_app-master/workspacex (1)/workspacex (1)/workspacex/lpc55s69_calc_starter/board/pin_mux.c
                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO1_5_DIGIMODE_DIGITAL));

    IOCON->PIO[1][7] = ((IOCON->PIO[1][7] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT17 (pin 9) is configured as PIO1_7. */
                        | IOCON_PIO_FUNC(PIO1_7_FUNC_ALT0)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO1_7_DIGIMODE_DIGITAL));

    IOCON->PIO[1][8] = ((IOCON->PIO[1][8] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT18 (pin 24) is configured as PIO1_8. */
                        | IOCON_PIO_FUNC(PIO1_8_FUNC_ALT0)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO1_8_DIGIMODE_DIGITAL));

    if (Chip_GetVersion()==1)
    {
        IOCON->PIO[1][9] = ((IOCON->PIO[1][9] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT19 (pin 10) is configured as PIO1_9. */
                        | IOCON_PIO_FUNC(PIO1_9_FUNC_ALT0)

                        /* Driver slew rate.
                         * : Fast-mode, output slew rate is faster.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO1_9_SLEW_FAST)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO1_9_DIGIMODE_DIGITAL));
    }
    else
    {
        IOCON->PIO[1][9] = ((IOCON->PIO[1][9] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT19 (pin 10) is configured as PIO1_9. */
                        | IOCON_PIO_FUNC(PIO1_9_FUNC_ALT0)

                        /* Driver slew rate.
                         * : Fast-mode, output slew rate is faster.
                         * Refer to the appropriate specific device data sheet for details. */
                        | IOCON_PIO_SLEW(PIO1_9_SLEW_FAST)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO1_9_DIGIMODE_DIGITAL));
    }
    if (Chip_GetVersion()==1)
        {
            const uint32_t port0_pin15_config = (/* Pin is configured as SD0_WR_PRT */
                                                 IOCON_PIO_FUNC5 |
                                                 /* No addition pin function */
                                                 IOCON_PIO_MODE_INACT |
                                                 /* Standard mode, output slew rate control is enabled */
                                                 IOCON_PIO_SLEW_STANDARD |
                                                 /* Input function is not inverted */
                                                 IOCON_PIO_INV_DI |
                                                 /* Enables digital function */
                                                 IOCON_PIO_DIGITAL_EN |
                                                 /* Open drain is disabled */
                                                 IOCON_PIO_OPENDRAIN_DI |
                                                 /* Analog switch is closed (enabled) */
                                                 IOCON_PIO_ASW_EN);
            /* PORT0 PIN15 (coords: 22) is configured as SD0_WR_PRT */
            IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);
        }
        else
        {
            const uint32_t port0_pin15_config = (/* Pin is configured as SD0_WR_PRT */
                                                 IOCON_PIO_FUNC5 |
                                                 /* No addition pin function */
                                                 IOCON_PIO_MODE_INACT |
                                                 /* Standard mode, output slew rate control is enabled */
                                                 IOCON_PIO_SLEW_STANDARD |
                                                 /* Input function is not inverted */
                                                 IOCON_PIO_INV_DI |
                                                 /* Enables digital function */
                                                 IOCON_PIO_DIGITAL_EN |
                                                 /* Open drain is disabled */
                                                 IOCON_PIO_OPENDRAIN_DI |
                                                 /* Analog switch is closed (enabled), only for A0 version */
                                                 IOCON_PIO_ASW_DIS_EN);
            /* PORT0 PIN15 (coords: 22) is configured as SD0_WR_PRT */
            IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);
        }

        const uint32_t port0_pin17_config = (/* Pin is configured as SD0_CARD_DET_N */
                                             IOCON_PIO_FUNC2 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN17 (coords: 8) is configured as SD0_CARD_DET_N */
        IOCON_PinMuxSet(IOCON, 0U, 17U, port0_pin17_config);

        const uint32_t port0_pin24_config = (/* Pin is configured as SD0_D0 */
                                             IOCON_PIO_FUNC2 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN24 (coords: 70) is configured as SD0_D0 */
        IOCON_PinMuxSet(IOCON, 0U, 24U, port0_pin24_config);

        const uint32_t port0_pin25_config = (/* Pin is configured as SD0_D1 */
                                             IOCON_PIO_FUNC2 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN25 (coords: 79) is configured as SD0_D1 */
        IOCON_PinMuxSet(IOCON, 0U, 25U, port0_pin25_config);


