Khalid10Z/reactjs_weather_app-master/workspacex (1)/workspacex (1)/workspacex/lpc55s69_calc_starter/board/pin_mux.c
        if (Chip_GetVersion()==1)
        {
            const uint32_t port0_pin31_config = (/* Pin is configured as SD0_D2 */
                                                 IOCON_PIO_FUNC2 |
                                                 /* No addition pin function */
                                                 IOCON_PIO_MODE_INACT |
                                                 /* Fast mode, slew rate control is disabled */
                                                 IOCON_PIO_SLEW_FAST |
                                                 /* Input function is not inverted */
                                                 IOCON_PIO_INV_DI |
                                                 /* Enables digital function */
                                                 IOCON_PIO_DIGITAL_EN |
                                                 /* Open drain is disabled */
                                                 IOCON_PIO_OPENDRAIN_DI |
                                                 /* Analog switch is closed (enabled) */
                                                 IOCON_PIO_ASW_EN);
            /* PORT0 PIN31 (coords: 23) is configured as SD0_D2 */
            IOCON_PinMuxSet(IOCON, 0U, 31U, port0_pin31_config);
        }
        else
        {
            const uint32_t port0_pin31_config = (/* Pin is configured as SD0_D2 */
                                                 IOCON_PIO_FUNC2 |
                                                 /* No addition pin function */
                                                 IOCON_PIO_MODE_INACT |
                                                 /* Fast mode, slew rate control is disabled */
                                                 IOCON_PIO_SLEW_FAST |
                                                 /* Input function is not inverted */
                                                 IOCON_PIO_INV_DI |
                                                 /* Enables digital function */
                                                 IOCON_PIO_DIGITAL_EN |
                                                 /* Open drain is disabled */
                                                 IOCON_PIO_OPENDRAIN_DI |
                                                 /* Analog switch is closed (enabled), only for A0 version */
                                                 IOCON_PIO_ASW_DIS_EN);
            /* PORT0 PIN31 (coords: 23) is configured as SD0_D2 */
            IOCON_PinMuxSet(IOCON, 0U, 31U, port0_pin31_config);
        }

        const uint32_t port0_pin7_config = (/* Pin is configured as SD0_CLK */
                                            IOCON_PIO_FUNC2 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN7 (coords: 6) is configured as SD0_CLK */
        IOCON_PinMuxSet(IOCON, 0U, 7U, port0_pin7_config);

        const uint32_t port0_pin8_config = (/* Pin is configured as SD0_CMD */
                                            IOCON_PIO_FUNC2 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN8 (coords: 26) is configured as SD0_CMD */
        IOCON_PinMuxSet(IOCON, 0U, 8U, port0_pin8_config);

        if (Chip_GetVersion()==1)
        {
            const uint32_t port0_pin9_config = (/* Pin is configured as SD0_POW_EN */
                                                IOCON_PIO_FUNC2 |
                                                /* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Standard mode, output slew rate control is enabled */
                                                IOCON_PIO_SLEW_STANDARD |
                                                /* Input function is not inverted */
                                                IOCON_PIO_INV_DI |
                                                /* Enables digital function */
                                                IOCON_PIO_DIGITAL_EN |
                                                /* Open drain is disabled */
                                                IOCON_PIO_OPENDRAIN_DI |
                                                /* Analog switch is closed (enabled) */
                                                IOCON_PIO_ASW_EN);
            /* PORT0 PIN9 (coords: 55) is configured as SD0_POW_EN */
            IOCON_PinMuxSet(IOCON, 0U, 9U, port0_pin9_config);
        }
        else
        {
            const uint32_t port0_pin9_config = (/* Pin is configured as SD0_POW_EN */
                                                IOCON_PIO_FUNC2 |
                                                /* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Standard mode, output slew rate control is enabled */
                                                IOCON_PIO_SLEW_STANDARD |
                                                /* Input function is not inverted */
                                                IOCON_PIO_INV_DI |
                                                /* Enables digital function */
                                                IOCON_PIO_DIGITAL_EN |
                                                /* Open drain is disabled */
                                                IOCON_PIO_OPENDRAIN_DI |
                                                /* Analog switch is closed (enabled), only for A0 version */
                                                IOCON_PIO_ASW_DIS_EN);
            /* PORT0 PIN9 (coords: 55) is configured as SD0_POW_EN */
            IOCON_PinMuxSet(IOCON, 0U, 9U, port0_pin9_config);
        }

