Khalid10Z/reactjs_weather_app-master/workspacex (1)/workspacex (1)/workspacex/lpc55s69_calc_starter/board/pin_mux.c
        if (Chip_GetVersion()==1)
        {
            const uint32_t port1_pin0_config = (/* Pin is configured as SD0_D3 */
                                                IOCON_PIO_FUNC2 |
                                                /* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Fast mode, slew rate control is disabled */
                                                IOCON_PIO_SLEW_FAST |
                                                /* Input function is not inverted */
                                                IOCON_PIO_INV_DI |
                                                /* Enables digital function */
                                                IOCON_PIO_DIGITAL_EN |
                                                /* Open drain is disabled */
                                                IOCON_PIO_OPENDRAIN_DI |
                                                /* Analog switch is closed (enabled) */
                                                IOCON_PIO_ASW_EN);
            /* PORT1 PIN0 (coords: 11) is configured as SD0_D3 */
            IOCON_PinMuxSet(IOCON, 1U, 0U, port1_pin0_config);
        }
        else
        {
            const uint32_t port1_pin0_config = (/* Pin is configured as SD0_D3 */
                                                IOCON_PIO_FUNC2 |
                                                /* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Fast mode, slew rate control is disabled */
                                                IOCON_PIO_SLEW_FAST |
                                                /* Input function is not inverted */
                                                IOCON_PIO_INV_DI |
                                                /* Enables digital function */
                                                IOCON_PIO_DIGITAL_EN |
                                                /* Open drain is disabled */
                                                IOCON_PIO_OPENDRAIN_DI |
                                                /* Analog switch is closed (enabled), only for A0 version */
                                                IOCON_PIO_ASW_DIS_EN);
            /* PORT1 PIN0 (coords: 11) is configured as SD0_D3 */
            IOCON_PinMuxSet(IOCON, 1U, 0U, port1_pin0_config);
        }
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
